{"data":{"page":{"__typename":"ContentfulArticle","id":"543946a6-23b0-59a1-90aa-bd5ca3f3bbd0","slug":"creative-block-almost-killed-me","title":"Creative Block Almost Killed Me: Here's How You Can Slay It","updatedAt":"2019-03-16T19:37:09.034Z","updatedAtString":"Mar 16, 2019 at 7:37pm","summary":{"text":"The following is a story about how creative block nearly killed me. And even more importantly, five steps you can use to annihilate it for good."},"fullPublishDate":"March 2, 2019","publishDate":"2019-03-12T00:07","content":{"richText":{"html":"<p>How many times have you Googled the phrase &quot;creative block&quot; in your life? How many times this month? This week? I&#39;ve lost count. And judging by the 930 million results that search returns, being stuck (creatively) is a problem that a bunch of other people are struggling with, too. It fucking sucks. I know.</p><h2>The Downward Spiral</h2><p>Back in July of 2016, I was living at home—I had impulsively quit my full-time job as a copywriter earlier that year to start my own design company. Things were going pretty well, and I was taking on every project that came my way.</p><p>One of my clients was looking to publish an illustrated book at the time, so naturally I said yes. Mind you, I was a web designer, and hadn&#39;t <u role='presentational'>really</u> illustrated much of anything, let alone designed an entire book. But screw it. I can totally do this!</p><p>Shocker...a few weeks into the project, it was starting to feel like I totally could NOT &quot;do this.&quot; I was overwhelmed by all the things I needed to learn in order to deliver the final product, but there was an even bigger problem: creative block had set in—badly. Just sitting down at the computer was painful. My illustrations looked like shit (to me), and the harder I tried to find inspiration, the more resistant my brain became to providing any kind of creative energy.</p><p>Around the same time, my cousin-in-law (who I had just seen in Utah) was placed in hospice and a family friend committed suicide, which was the final straw. I fell into total burnout mode: ignoring emails, playing video games, binging TV series, reading design &quot;inspiration&quot; articles, and arguing mindlessly about politics on Reddit 24/7. Basically, doing anything and everything I could think of to jump start my creative process.</p><p>This culminated in what I can only describe as &quot;the worst day of my life.&quot;</p><p>I hadn&#39;t eaten anything or moved from my spot on the living room for the past five hours. I hadn&#39;t talked to anyone or left the house in...fuck, I have no clue how long. My phone was on, but only because I knew that if I turned it off someone would think I was dead—which would mean police. Which would mean interacting with the outside world.</p><p>Around that time, a car pulled into the driveway. I remember my first thought being, &quot;Oh shit...THEY FOUND ME.&quot; Which is kind of funny in retrospect, because, like...who did I think was after me? I was a designer running late on a small illustration project, not Tom Cruise dodging taser-wielding agents in <a href=\"https://youtu.be/xtXdKETotbc?t=109\">Minority Report</a>.</p><p>I high-tailed it to my room, and put some serious thought to <u role='presentational'>jumping</u> hopping out the back window. It wasn&#39;t the cops (taser-wielding or otherwise). It turned out to be my ex-professor/creative partner&#39;s son, who she had sent over to check on me. Nonetheless, I knew there would be more humans where that one came from...none of whom I cared to confront, let alone carry out a conversation with.</p><p>I threw my bike in the back of my car and headed over to the local library. Why the library, you ask? Well, the plan, as I recall, was to drop my car off at the nearest parking lot then bike back to my house so I could make it look like I wasn&#39;t home and buy some time while I gathered any essential belongings that would be accompanying me on my escape to the forest, where I would live happily ever after and never wrestle with creativity again.</p><p>It was a beautiful plan.</p><p>Sadly, or maybe fortunately, I didn&#39;t make it two blocks before a cop car rolled around the corner and flagged me down. Like Tom Cruise, I was ready to fucking run. But I somehow managed to play it cool (enough).</p><p><i>No, I hadn&#39;t realized people were trying to get in touch with me for weeks...yes, I&#39;ll call them back...me, I&#39;m fine...oh, the bike? I was just...uh, going for a bike...ride...nice day, isn&#39;t it?</i></p><p>The cop eventually drove off, and I was left idling in the middle of the road—a fitting metaphor for my current outlook on life. I started mentally backpedaling though the chain of events that had led to this moment. Like <a href=\"https://www.youtube.com/watch?v=xVEYcTyj1Do\">Theoden trapped at Helm&#39;s Deep</a>, beset by a massive army of Uruk-hai, desolately wondering: &quot;How did it come to this?&quot; And more importantly, what was I going to do about it?</p><img class='contentful-embedded-asset' src=\"//images.ctfassets.net/jbawaa5001ko/75aJaSmdKslmmvCPfmcJQP/1c042c52bd72c7712045076ef8b9cd3a/2vmkfe.jpg\"/><p></p><h2>The Road Back</h2><p>I wish I could say I learned a hard, swift lesson from that experience. But the truth is, while I did start to take my mental/emotional <u role='presentational'>health</u> wellbeing more seriously, creative block continued to haunt me on a daily basis, and it took the better part of three years to distill my mistakes into an effective solution.</p><p>That&#39;s what I&#39;m going to share with you now: a bullet-proof, battle-tested strategy to slay creative block once and for all.</p><h2>Step 1: Define Creative Block</h2><p>&quot;To defeat your enemy, you must first know your enemy.&quot; —Sun Tzu</p><p>Actually, Sun Tzu didn&#39;t say that. But it sounds like something he might say, and I don&#39;t want to get sidetracked by Googling a real quote right now. (We&#39;re trying to stay creative, remember?)</p><p>You see, I think people get <i>wayyy</i> to fancy with their definition of creative block: it&#39;s a lack of inspiration, it&#39;s self-doubt, it&#39;s negative self-talk, it&#39;s rejection anxiety...</p><p>Fuck all that. I&#39;ll tell you what creative block is; it&#39;s very simple:</p><blockquote><p>Creative block is a shortage of mental energy that results from consistently inputting more than you output.</p></blockquote><p>This is a highly effective place to start when diagnosing your creative woes. Try saying it out loud: &quot;I am tired and uncreative because I have input more that I have output today.&quot; How did that feel? Does the problem seem slightly more manageable now? Good, let&#39;s keep going.</p><h2>Step 2: List Your Mental Earning and Spending</h2><p>I used to think that my brain was magical—that I had an unlimited supply of energy, which could be drawn upon endlessly without fail. This was/is clearly not true. So, when you try to understand what&#39;s causing your creative block, it can be really helpful to divide your day-to-day activities into two categories: mental earning and mental spending.</p><p><b>Mental Earning:</b> the act of producing or changing something. Designing a landing page, writing a blog post, playing the drums, or even organizing your room. By definition, you have been creative by doing one of these things—there is an immediate benefit.</p><p><b>Mental Spending:</b> refers to passive stuff, like watching YouTube videos, browsing Reddit, listening to a podcast, or shopping on Amazon. You may pick up inspiration from these things, but they don&#39;t benefit you until you act on that inspiration.</p><p>Now that you&#39;re aware of these two categories, what I want you to do is grab a piece of paper and write down all the things that give you energy on one side and all the things that drain your energy on the other side. Here are a few of mine:</p><p></p><img class='contentful-embedded-asset' src=\"//images.ctfassets.net/jbawaa5001ko/3YxYc1F6dI84QhUppWwQLB/7f6491d576e9a497ef3b5b31a72d8261/IMG_2290.jpg\"/><h2>Step 3: Shed the Dead Weight</h2><p>Ok, you&#39;ve got your list. Next, you&#39;re going to <a href=\"https://www.youtube.com/watch?v=6RIJYKm5WeI\">Marie Kondo</a> this list by killing off anything that&#39;s not helping you progress as a creative human. For each item on the &quot;Draining&quot; side of your list, ask yourself one question:</p><blockquote><p>Does this thing <i>actually</i> make my life better, or does it just <i>feel</i> that way?</p></blockquote><p>When going through this process, it&#39;s essential to only consider the cold hard facts because &quot;sugary&quot; addictions will try to justify their existence in very sneaky ways. For example, when I stopped using dating apps, I could hear this little voice in my head protesting: &quot;But you&#39;re missing out on all these opportunities to meet people!&quot;</p><p>Dating apps make us feel good in the moment by showing lots of pictures of attractive people (it&#39;s basically micro-porn). But over the past three years, I&#39;ve probably spent hundreds of hours on Tinder, OkCupid, et al., and I have only one very mediocre date to show for it. I&#39;ve literally gotten better results by hanging out at my local climbing gym for five minutes!</p><p>When you add up how much time these &quot;feel-good&quot; pursuits suck up on a daily basis (with no tangible benefits) it&#39;s absolutely staggering. That&#39;s why you need to be super-ruthless in hunting them down and jettisoning them from your life before they suck you dry. Take your list and nail it to the wall, if necessary!</p><h2>Step 4: Redefine &quot;Creative&quot; and &quot;Output&quot;</h2><p>You&#39;re familiar with the <a href=\"https://www.psychologytoday.com/us/blog/hollywood-the-couch/201205/dealing-your-inner-critic\">punishing inner critic</a>, right? It&#39;s that little voice in your head that says    everything you create is garbage and everything you accomplish is not enough. Well, if you&#39;re really serious about sticking to the list you just made, you need to confront that voice—or it&#39;s  going to keep making you miserable.</p><p>The simplest way to disarm your inner critic is to redefine the words &quot;creative&quot; and &quot;output.&quot; Firstly, let&#39;s expand the kind of work we deem to be creative. I&#39;m not advising you to lower your ambitions, but, rather, to take note of the many small wins that would normally fly under the radar.</p><p>Say you&#39;re spinning your wheels on a logo design—it feels like you haven&#39;t done anything creative all day. Instead of comparing that work against the best logo you&#39;ve ever made, readjust your mental &quot;zoom&quot; to only cover the designs you&#39;re currently working on. From that perspective, one or two iterations will stand out as more creative than the others. And, voila! You&#39;ve suddenly &quot;done&quot; something creative by retroactively changing your standards. You can then use that small rush of inspiration to slingshot you toward an even better iteration.</p><p>Similarly, you&#39;re not going to have the same level of energy every day, so it&#39;s emotionally toxic to expect the same level of output at all times. If you find yourself mentally exhausted before you&#39;ve finished breakfast (the struggle is real), scale back the list of things you want to accomplish. You might end up doing more than you thought you could, and adding extra items to a to-do list is way more empowering than struggling to complete one that feels like it&#39;s a mile long.</p><h2>Step 5: Stay Vigilant</h2><p>Money is much easier to spend than earn; your brain is no different. If want to keep creative block at bay, you need to be mindful of the different ways that it can slither back into your life. It&#39;s like Mad-Eye Moody says: &quot;Constant vigilance!&quot; I think there are basically four ways to do this—although feel free to adopt more strategies as you go.</p><p></p><img class='contentful-embedded-asset' src=\"//images.ctfassets.net/jbawaa5001ko/Ux7thnklgRbb8IQRXch1w/65e72594a77e04b0eee5c118221fb9fe/constantvigilance.png\"/><h3>Emotional Zagging</h3><p>Disappointment and frustration are the two of the biggest culprits behind creative block. When I started to feel trapped by the illustration project, I should have taken a breather to assess the situation and figure out what the best course of action was. Instead, I pushed myself to the point of emotional burnout, then went on a mental spending tear to try and distract from the pain of creative block.</p><p>Now, whenever I get a pang of anxiety, I do an &quot;emotional zag,&quot; which essentially means taking negative energy and using it to slingshot you in an opposite (positive) direction. Energy is energy, after all. So, when I feel the urge to erase an especially brutal round of logo revisions by aimlessly swiping on Tinder, I go straight out for a run instead.</p><h3>Stick to the Mission</h3><p>UX design has made the platforms and apps we use so fucking &quot;convenient&quot; that a five-second search on Google can (and will) turn into three hours of binge-watching cat videos on YouTube. Always, ALWAYS, have a singular, achievable mission when you dive into social media. Once you find the information you need, bail <i>immediately</i>. You can even set a timer on your phone and write your objective down on a piece of paper, if necessary.</p><h3>Maintain an Input / Output Ratio</h3><p>I find I&#39;m the happiest and most creative when I spend 90% of my time creating and 10% learning or browsing for inspiration—anything below 75% is getting into the danger zone. When you find a balance that works for you, post it on your wall or somewhere you&#39;ll see it often. Do a mental check throughout the day to make sure you&#39;re in the clear.</p><h3>Create Your Own Rulebook</h3><p>I have a Daily Log database in <a href=\"https://www.notion.so/\">Notion</a> (more on this in another post) where I track personal stats, one of those being a &quot;Rules Broken&quot; field that lists any personal rules that I broke that day—No screens after 10pm, Get out of bed instantly, etc. You don&#39;t have to get this fancy; your rule log might just be a simple list scrawled on the back cover of your notebook. But whichever method you choose, keeping track of your slip-ups can help you see when something is becoming a negative pattern.</p><h2>Alright, that&#39;s it.</h2><p>You now have all the weapons you need to slay creative block for good. It won&#39;t be easy, but if you follow these five steps, you&#39;ll be amazed by how quickly it slithers back to the dark, dismal hole it came from. If you want to drop a comment or question, head over to the article link on Reddit. Be well, everyone.</p>"}},"coverImage":{"title":"Theoden Helm's Deep","alt":"","fluid":{"base64":"data:image/jpeg;base64,/9j/4AAQSkZJRgABAQEASABIAAD/2wBDAAMCAgMCAgMDAwMEAwMEBQgFBQQEBQoHBwYIDAoMDAsKCwsNDhIQDQ4RDgsLEBYQERMUFRUVDA8XGBYUGBIUFRT/2wBDAQMEBAUEBQkFBQkUDQsNFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBT/wAARCAALABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAUHBv/EACkQAAEEAQMCBQUBAAAAAAAAAAIBAwQRBQAGEgchExQiMWEIMkFRkcH/xAAWAQEBAQAAAAAAAAAAAAAAAAAFAAL/xAAdEQEAAQMFAAAAAAAAAAAAAAABAAIDIRESMlFS/9oADAMBAAIRAxEAPwCWZ7qlEk5zOtGoKTT5yRkKg+EyyZ0yJVXf7/ZK9Ioi2taddZt+bXzu4cNidrlCSE5iwKOIojbhv8ltFX3tUW1urVPjUC6BZibK2rvNx6S465JkYfHPGa2Rxzekc21X9LxH57JWnn1IccBvWaOPbaip5nw/Q2N8SBzkl17L/l6ZbtW2lHBCy2ZO5ut9Lg8JMx0TDNtTwCEPmX3HTHk/zNCqvxSD/dGotu7Iv4ubCajkIgUFg1Q2xPuoJfckXRqa3XkzGPJP/9k=","aspectRatio":1.7777777777777777,"src":"//images.ctfassets.net/jbawaa5001ko/5BhsJrv8e94nJmAaFTIA8p/8365bd8d833cfec13d442bbd3bbae3d9/the-lord-of-the-rings-image-1.jpg?w=1920&q=50","srcSet":"//images.ctfassets.net/jbawaa5001ko/5BhsJrv8e94nJmAaFTIA8p/8365bd8d833cfec13d442bbd3bbae3d9/the-lord-of-the-rings-image-1.jpg?w=480&h=270&q=50 480w,\n//images.ctfassets.net/jbawaa5001ko/5BhsJrv8e94nJmAaFTIA8p/8365bd8d833cfec13d442bbd3bbae3d9/the-lord-of-the-rings-image-1.jpg?w=960&h=540&q=50 960w,\n//images.ctfassets.net/jbawaa5001ko/5BhsJrv8e94nJmAaFTIA8p/8365bd8d833cfec13d442bbd3bbae3d9/the-lord-of-the-rings-image-1.jpg?w=1920&h=1080&q=50 1920w","sizes":"(max-width: 1920px) 100vw, 1920px"}},"author":{"name":"Andrew Folts","avatar":{"title":"Andrew Folts profile photo","alt":"","fluid":{"base64":"data:image/jpeg;base64,/9j/4AAQSkZJRgABAQEAlgCWAAD/2wBDAAMCAgMCAgMDAwMEAwMEBQgFBQQEBQoHBwYIDAoMDAsKCwsNDhIQDQ4RDgsLEBYQERMUFRUVDA8XGBYUGBIUFRT/2wBDAQMEBAUEBQkFBQkUDQsNFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBQUFBT/wAARCAAUABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAgFBgf/xAAnEAACAQMDAgYDAAAAAAAAAAABAgQDBREABiEHEggTFDFBYRdR0f/EABYBAQEBAAAAAAAAAAAAAAAAAAQFA//EACARAAIABgIDAAAAAAAAAAAAAAABAgMREhMhMTNBsfD/2gAMAwEAAhEDEQA/AKX3hf6e1bNWnOncEBJJBIUD3JA5IH1rh+nnVcbuv8qxzlopPRfMQUlKntxnlST8fP8AdaXXK4GybYM5wlSKwaPWSqpZEBUsKhA5IXtycfHvwMibOjHUix/mOn6q/RIkaXXZKU/03kiQ6rhI5YZRSRk4LcgADBONZYk4LitKUrC68lbTKBWuQBxprQkVKLOGBDAjIIPB00OwJcQft3rbuzf3iJ2213nLWiCRWi04CJiPTR6FQNhfck/sknga878Q5EPeltstFEo231cqsKFJQihhlRjtxjgnTTVxpKXr7QyDthXiq9nB2TqXu7bNrowrTue7W6GCzLHjzHRFPcRwAfoaaaaNRCmj/9k=","aspectRatio":1,"src":"//images.ctfassets.net/jbawaa5001ko/2zp1feJo07IiG6YwZXudNr/ecc0f0eaf4e5952ddef7f0a3bb706569/smiling-lumberjack-1.jpg?w=250&q=50","srcSet":"//images.ctfassets.net/jbawaa5001ko/2zp1feJo07IiG6YwZXudNr/ecc0f0eaf4e5952ddef7f0a3bb706569/smiling-lumberjack-1.jpg?w=63&h=63&q=50 63w,\n//images.ctfassets.net/jbawaa5001ko/2zp1feJo07IiG6YwZXudNr/ecc0f0eaf4e5952ddef7f0a3bb706569/smiling-lumberjack-1.jpg?w=125&h=125&q=50 125w,\n//images.ctfassets.net/jbawaa5001ko/2zp1feJo07IiG6YwZXudNr/ecc0f0eaf4e5952ddef7f0a3bb706569/smiling-lumberjack-1.jpg?w=250&h=250&q=50 250w,\n//images.ctfassets.net/jbawaa5001ko/2zp1feJo07IiG6YwZXudNr/ecc0f0eaf4e5952ddef7f0a3bb706569/smiling-lumberjack-1.jpg?w=375&h=375&q=50 375w,\n//images.ctfassets.net/jbawaa5001ko/2zp1feJo07IiG6YwZXudNr/ecc0f0eaf4e5952ddef7f0a3bb706569/smiling-lumberjack-1.jpg?w=500&h=500&q=50 500w,\n//images.ctfassets.net/jbawaa5001ko/2zp1feJo07IiG6YwZXudNr/ecc0f0eaf4e5952ddef7f0a3bb706569/smiling-lumberjack-1.jpg?w=628&h=628&q=50 628w","sizes":"(max-width: 250px) 100vw, 250px"}}}}},"pageContext":{"slug":"creative-block-almost-killed-me"}}